bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
// #############################################################################
// #### Copyright ##############################################################
// #############################################################################

/*
 * Copyright 2024 BaSSeM
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

// #############################################################################
// #### Description ############################################################
// #############################################################################

// #############################################################################
// #### Control Include(s) #####################################################
// #############################################################################

#include "Platform.h"

// #############################################################################
// #### Control Macro(s) #######################################################
// #############################################################################

#ifndef DEBUG
    #define DEBUG
#endif

#ifdef DEBUG
    #undef DEBUG
#endif

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#ifdef STM32L496xx

// #############################################################################
// #### Include(s) #############################################################
// #############################################################################

    #include "../../SPI_Internal.h"
    #include "SPI_STM32L496VGT6P.h"

    #include "stm32l4xx.h"
    #include "stm32l4xx_hal_spi.h"

// #############################################################################
// #### Private Macro(s) #######################################################
// #############################################################################

    #define USE_DMA 1

// #############################################################################
// #### Private Type(s) ########################################################
// #############################################################################

/**
 * @brief SPI STM32L496VGT6P Operation
 *
 * @enum SPI_STM32L496VGT6P_OperationType_t
 */
typedef enum SPI_STM32L496VGT6P_OperationType
{
    SPI_STM32L496VGT6P_OperationType_None = 0,    ///< None
    SPI_STM32L496VGT6P_OperationType_Pending,     ///< Pending
    SPI_STM32L496VGT6P_OperationType_Commit,      ///< Commit
    SPI_STM32L496VGT6P_OperationType_Transmit,    ///< Transmit
    SPI_STM32L496VGT6P_OperationType_Receive,     ///< Receive
    SPI_STM32L496VGT6P_OperationType_Transaction, ///< Transaction
} SPI_STM32L496VGT6P_OperationType_t;

/**
 * @brief SPI STM32L496VGT6P Operation Handler
 */
typedef SPI_STM32L496VGT6P_Status_t ( *SPI_STM32L496VGT6P_OperationHandler_t )( SPI_STM32L496VGT6P_Instance_t * Instance );

/**
 * @brief SPI STM32L496VGT6P Operation Context
 *
 * @struct SPI_STM32L496VGT6P_OperationContext_t
 */
typedef struct SPI_STM32L496VGT6P_OperationContext
{
    SPI_STM32L496VGT6P_Data_t * DataTx;
    SPI_STM32L496VGT6P_DataLength_t DataTxLength;

    SPI_STM32L496VGT6P_Data_t * DataRx;
    SPI_STM32L496VGT6P_DataLength_t DataRxLength;
} SPI_STM32L496VGT6P_OperationContext_t;

/**
 * @brief SPI STM32L496VGT6P Operation
 *
 * @struct SPI_STM32L496VGT6P_Operation_t
 */
typedef struct SPI_STM32L496VGT6P_Operation
{
    SPI_STM32L496VGT6P_OperationType_t Type;       ///< Type
    SPI_STM32L496VGT6P_OperationHandler_t Handler; ///< Handler
    SPI_STM32L496VGT6P_Status_t Status;            ///< Status
    TIM_Timestamp_t Timeout;                       ///< Timeout
    SPI_STM32L496VGT6P_OperationContext_t Context; ///< Context
} SPI_STM32L496VGT6P_Operation_t;

/**
 * @brief SPI STM32L496VGT6P Process Type
 *
 * @enum SPI_STM32L496VGT6P_ProcessType_t
 */
typedef enum SPI_STM32L496VGT6P_ProcessType
{
    SPI_STM32L496VGT6P_ProcessType_None = 0,    ///< None
    SPI_STM32L496VGT6P_ProcessType_Initialize,  ///< Initialize
    SPI_STM32L496VGT6P_ProcessType_Transmit,    ///< Transmit
    SPI_STM32L496VGT6P_ProcessType_Receive,     ///< Receive
    SPI_STM32L496VGT6P_ProcessType_Transaction, ///< Transaction
} SPI_STM32L496VGT6P_ProcessType_t;

/**
 * @brief SPI STM32L496VGT6P Process Handler
 */
typedef SPI_STM32L496VGT6P_Status_t ( *SPI_STM32L496VGT6P_ProcessHandler_t )( SPI_STM32L496VGT6P_Instance_t * Instance );

/**
 * @brief SPI STM32L496VGT6P Process Context
 *
 * @struct SPI_STM32L496VGT6P_ProcessContext_t
 */
typedef struct SPI_STM32L496VGT6P_ProcessContext
{
    SPI_STM32L496VGT6P_Operation_t Operation; ///< Operation
} SPI_STM32L496VGT6P_ProcessContext_t;

/**
 * @brief SPI STM32L496VGT6P Process
 *
 * @struct SPI_STM32L496VGT6P_Process_t
 */
typedef struct SPI_STM32L496VGT6P_Process
{
    SPI_STM32L496VGT6P_ProcessType_t Type;       ///< Type
    SPI_STM32L496VGT6P_ProcessHandler_t Handler; ///< Handler
    SPI_STM32L496VGT6P_ProcessContext_t Context; ///< Context
} SPI_STM32L496VGT6P_Process_t;

/**
 * @brief SPI STM32L496VGT6P Event
 *
 * @enum SPI_STM32L496VGT6P_Event_t
 */
typedef enum SPI_STM32L496VGT6P_Event
{
    SPI_STM32L496VGT6P_Event_None = 0,
    SPI_STM32L496VGT6P_Event_Interrupt = UTIL_BIT( 0 ),
    SPI_STM32L496VGT6P_Event_TxComplete = UTIL_BIT( 1 ),
    SPI_STM32L496VGT6P_Event_RxComplete = UTIL_BIT( 2 ),
    SPI_STM32L496VGT6P_Event_Abort = UTIL_BIT( 3 ),
    SPI_STM32L496VGT6P_Event_Error = UTIL_BIT( 4 ),
} SPI_STM32L496VGT6P_Event_t;

typedef struct SPI_STM32L496VGT6P_Instance_Context
{
    SPI_HandleTypeDef SPIx;

    SPI_STM32L496VGT6P_Event_t Event;

    SPI_STM32L496VGT6P_Process_t Process;
} SPI_STM32L496VGT6P_Instance_Context_t;

typedef struct SPI_STM32L496VGT6P_Context
{
    TIM_Timestamp_t Timestamp;
    SPI_STM32L496VGT6P_Instance_Context_t Context[ SPI_STM32L496VGT6P_Count ];
} SPI_STM32L496VGT6P_Context_t;

// #############################################################################
// #### Private Method(s) Prototype ############################################
// #############################################################################

void SPI1_IRQHandler( void );
void SPI2_IRQHandler( void );
void SPI3_IRQHandler( void );

