bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
void HAL_SPI_TxCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_RxCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_TxRxCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_TxHalfCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_RxHalfCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_TxRxHalfCpltCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_ErrorCallback( SPI_HandleTypeDef * hspi );
void HAL_SPI_AbortCpltCallback( SPI_HandleTypeDef * hspi );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_Initialize( void );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_Cycle( void );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_DeInitialize( void );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_Initialize( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_Cycle( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_DeInitialize( SPI_STM32L496VGT6P_Instance_t * Instance );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_SetProcess( SPI_STM32L496VGT6P_Instance_t * Instance, SPI_STM32L496VGT6P_ProcessType_t ProcessType );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessInitialize( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessTransmit( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessReceive( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessTransaction( SPI_STM32L496VGT6P_Instance_t * Instance );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationCommitExecute( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationCommitResolve( SPI_STM32L496VGT6P_Instance_t * Instance );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransmitExecute( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransmitResolve( SPI_STM32L496VGT6P_Instance_t * Instance );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationReceiveExecute( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationReceiveResolve( SPI_STM32L496VGT6P_Instance_t * Instance );

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransactionExecute( SPI_STM32L496VGT6P_Instance_t * Instance );
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransactionResolve( SPI_STM32L496VGT6P_Instance_t * Instance );

// #############################################################################
// #### Private Variable(s) ####################################################
// #############################################################################

static SPI_STM32L496VGT6P_Context_t SPI_STM32L496VGT6P_Context;

// #############################################################################
// #### Private Method(s) ######################################################
// #############################################################################

void SPI1_IRQHandler( void )
{
    SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_1 ];

    Context->Event |= SPI_STM32L496VGT6P_Event_Interrupt;

    HAL_SPI_IRQHandler( &Context->SPIx );
}

void SPI2_IRQHandler( void )
{
    SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_2 ];

    Context->Event |= SPI_STM32L496VGT6P_Event_Interrupt;

    HAL_SPI_IRQHandler( &Context->SPIx );
}

void SPI3_IRQHandler( void )
{
    SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_3 ];

    Context->Event |= SPI_STM32L496VGT6P_Event_Interrupt;

    HAL_SPI_IRQHandler( &Context->SPIx );
}

void HAL_SPI_TxCpltCallback( SPI_HandleTypeDef * hspi )
{
    for ( SPI_STM32L496VGT6P_t SPI_x = SPI_STM32L496VGT6P_1; SPI_x < SPI_STM32L496VGT6P_Count; ++SPI_x )
    {
        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_x ];

        if ( &Context->SPIx == hspi )
        {
            Context->Event |= SPI_STM32L496VGT6P_Event_TxComplete;
            break;
        }
    }
}

void HAL_SPI_RxCpltCallback( SPI_HandleTypeDef * hspi )
{
    for ( SPI_STM32L496VGT6P_t SPI_x = SPI_STM32L496VGT6P_1; SPI_x < SPI_STM32L496VGT6P_Count; ++SPI_x )
    {
        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_x ];

        if ( &Context->SPIx == hspi )
        {
            Context->Event |= SPI_STM32L496VGT6P_Event_RxComplete;
            break;
        }
    }
}

void HAL_SPI_TxRxCpltCallback( SPI_HandleTypeDef * hspi )
{
    for ( SPI_STM32L496VGT6P_t SPI_x = SPI_STM32L496VGT6P_1; SPI_x < SPI_STM32L496VGT6P_Count; ++SPI_x )
    {
        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_x ];

        if ( &Context->SPIx == hspi )
        {
            Context->Event |= SPI_STM32L496VGT6P_Event_TxComplete | SPI_STM32L496VGT6P_Event_RxComplete;
            break;
        }
    }
}

void HAL_SPI_TxHalfCpltCallback( SPI_HandleTypeDef * hspi )
{
}

void HAL_SPI_RxHalfCpltCallback( SPI_HandleTypeDef * hspi )
{
}

void HAL_SPI_TxRxHalfCpltCallback( SPI_HandleTypeDef * hspi )
{
}

void HAL_SPI_ErrorCallback( SPI_HandleTypeDef * hspi )
{
    for ( SPI_STM32L496VGT6P_t SPI_x = SPI_STM32L496VGT6P_1; SPI_x < SPI_STM32L496VGT6P_Count; ++SPI_x )
    {
        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_x ];

        if ( &Context->SPIx == hspi )
        {
            Context->Event |= SPI_STM32L496VGT6P_Event_Error;
            break;
        }
    }
}

void HAL_SPI_AbortCpltCallback( SPI_HandleTypeDef * hspi )
{
    for ( SPI_STM32L496VGT6P_t SPI_x = SPI_STM32L496VGT6P_1; SPI_x < SPI_STM32L496VGT6P_Count; ++SPI_x )
    {
        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ SPI_x ];

