bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
        if ( &Context->SPIx == hspi )
        {
            Context->Event |= SPI_STM32L496VGT6P_Event_Abort;
            break;
        }
    }
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_Initialize( void )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( void )", __FUNCTION__ );

        // FIXME Remove the usage of `MX_SPIx_Init()`
        // FIXME Keep CubeMX generated configurations as is for now
    #if 1
        extern SPI_HandleTypeDef hspi1;
        extern DMA_HandleTypeDef hdma_spi1_tx;
        extern void MX_SPI1_Init( void );
        MX_SPI1_Init( );
        SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_1 ].SPIx = hspi1;
        #if USE_DMA
        __HAL_LINKDMA( &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_1 ].SPIx, hdmatx, hdma_spi1_tx );
        #endif
        extern SPI_HandleTypeDef hspi2;
        extern DMA_HandleTypeDef hdma_spi2_tx;
        extern DMA_HandleTypeDef hdma_spi2_rx;
        extern void MX_SPI2_Init( void );
        MX_SPI2_Init( );
        SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_2 ].SPIx = hspi2;
        #if USE_DMA
        __HAL_LINKDMA( &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_2 ].SPIx, hdmatx, hdma_spi2_tx );
        __HAL_LINKDMA( &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_2 ].SPIx, hdmarx, hdma_spi2_rx );
        #endif

        extern SPI_HandleTypeDef hspi3;
        extern DMA_HandleTypeDef hdma_spi3_tx;
        extern DMA_HandleTypeDef hdma_spi3_rx;
        extern void MX_SPI3_Init( void );
        MX_SPI3_Init( );
        SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_3 ].SPIx = hspi3;
        #if USE_DMA
        __HAL_LINKDMA( &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_3 ].SPIx, hdmatx, hdma_spi3_tx );
        __HAL_LINKDMA( &SPI_STM32L496VGT6P_Context.Context[ SPI_STM32L496VGT6P_3 ].SPIx, hdmarx, hdma_spi3_rx );
        #endif
    #endif
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_Cycle( void )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( void )", __FUNCTION__ );

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_GetTimestamp( SPI_TIM, &SPI_STM32L496VGT6P_Context.Timestamp ) ) != TIM_Status_Success )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Context_DeInitialize( void )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( void )", __FUNCTION__ );
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_Initialize( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];

        // TODO GPIOs Configurations

        Context->Event = SPI_STM32L496VGT6P_Event_None;

        Instance->Context = Context;

        Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_Initialize );
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_Cycle( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;
    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;
        SPI_STM32L496VGT6P_Event_t Event = Context->Event; // CAUTION: Has to copy events occurred at the early start of the cycle, so as to be cleared at the end of the cycle,
                                                           //          which let events occurs after that for the next cycle call

        // FIXME Interrupt callback occurs and cleared before being captured by ongoing operation

        if ( Operation->Handler != NULL )
        {
            SPI_STM32L496VGT6P_Status_t STM32L496VGT6P_Status = SPI_STM32L496VGT6P_Status_Error;
            if ( ( STM32L496VGT6P_Status = Operation->Handler( Instance ) ) != SPI_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Operation reported non success status, is there any action ?
            }
        }

        if ( Process->Handler != NULL )
        {
            SPI_STM32L496VGT6P_Status_t STM32L496VGT6P_Status = SPI_STM32L496VGT6P_Status_Error;
            if ( ( STM32L496VGT6P_Status = Process->Handler( Instance ) ) != SPI_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Process reported non success status, is there any action ?
            }
        }

        if ( ( Event & SPI_STM32L496VGT6P_Event_Interrupt ) == SPI_STM32L496VGT6P_Event_Interrupt )
        {
            Context->Event &= ~SPI_STM32L496VGT6P_Event_Interrupt;
            SPI_Trace( "Interrupt: Instance=%p, SPIx=%d", Instance, Instance->SPIx );
            // TODO Invoke Callback
        }

        if ( ( Event & SPI_STM32L496VGT6P_Event_TxComplete ) == SPI_STM32L496VGT6P_Event_TxComplete )
        {
            Context->Event &= ~SPI_STM32L496VGT6P_Event_TxComplete;
            SPI_Debug( "TX Complete: Instance=%p, SPIx=%d", Instance, Instance->SPIx );
            // TODO Invoke Callback
        }

        if ( ( Event & SPI_STM32L496VGT6P_Event_RxComplete ) == SPI_STM32L496VGT6P_Event_RxComplete )
        {
            Context->Event &= ~SPI_STM32L496VGT6P_Event_RxComplete;
            SPI_Debug( "RX Complete: Instance=%p, SPIx=%d", Instance, Instance->SPIx );
            // TODO Invoke Callback
        }

        if ( ( Event & SPI_STM32L496VGT6P_Event_Abort ) == SPI_STM32L496VGT6P_Event_Abort )
        {
            Context->Event &= ~SPI_STM32L496VGT6P_Event_Abort;
            SPI_Debug( "Abort: Instance=%p, SPIx=%d", Instance, Instance->SPIx );
            // TODO Invoke Callback
        }

