bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
        if ( ( Event & SPI_STM32L496VGT6P_Event_Error ) == SPI_STM32L496VGT6P_Event_Error )
        {
            Context->Event &= ~SPI_STM32L496VGT6P_Event_Error;
            SPI_Debug( "Error: Instance=%p, SPIx=%d", Instance, Instance->SPIx );
            // TODO Invoke Callback
        }
    }
    while ( 0 );
    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Instance_DeInitialize( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        // TODO De-Initialize & Disable SPI
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_SetProcess( SPI_STM32L496VGT6P_Instance_t * Instance, SPI_STM32L496VGT6P_ProcessType_t ProcessType )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p, ProcessType=%d )", __FUNCTION__, Instance, ProcessType );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        switch ( ProcessType )
        {
            case SPI_STM32L496VGT6P_ProcessType_None:
                Process->Handler = NULL;
                break;

            case SPI_STM32L496VGT6P_ProcessType_Initialize:
                Process->Handler = SPI_STM32L496VGT6P_ProcessInitialize;
                break;

            case SPI_STM32L496VGT6P_ProcessType_Transmit:
                Process->Handler = SPI_STM32L496VGT6P_ProcessTransmit;
                break;

            case SPI_STM32L496VGT6P_ProcessType_Receive:
                Process->Handler = SPI_STM32L496VGT6P_ProcessReceive;
                break;

            case SPI_STM32L496VGT6P_ProcessType_Transaction:
                Process->Handler = SPI_STM32L496VGT6P_ProcessTransaction;
                break;

            default:
                SPI_Warning( "%s Not Handled Type %d", __FUNCTION__, ProcessType );
                Status = SPI_STM32L496VGT6P_Status_NotSupported;
                break;
        }
        if ( Status != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Process->Type = ProcessType;

        Operation->Handler = NULL;
        Operation->Status = SPI_STM32L496VGT6P_Status_Success;
        Operation->Timeout = SPI_STM32L496VGT6P_Context.Timestamp;

        switch ( ProcessType )
        {
            case SPI_STM32L496VGT6P_ProcessType_None:
                Operation->Type = SPI_STM32L496VGT6P_OperationType_None;
                break;

            default:
                Operation->Type = SPI_STM32L496VGT6P_OperationType_Pending;
                break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessInitialize( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_Initialize )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, SPI_STM32L496VGT6P_ProcessType_Initialize );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != SPI_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = SPI_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case SPI_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = SPI_STM32L496VGT6P_OperationCommitExecute( Instance );
                break;

            case SPI_STM32L496VGT6P_OperationType_Commit:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessTransmit( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_Transmit )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, SPI_STM32L496VGT6P_ProcessType_Transmit );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != SPI_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = SPI_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case SPI_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = SPI_STM32L496VGT6P_OperationTransmitExecute( Instance );
                break;

            case SPI_STM32L496VGT6P_OperationType_Transmit:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

