bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessReceive( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_Receive )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, SPI_STM32L496VGT6P_ProcessType_Receive );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != SPI_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = SPI_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case SPI_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = SPI_STM32L496VGT6P_OperationReceiveExecute( Instance );
                break;

            case SPI_STM32L496VGT6P_OperationType_Receive:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_ProcessTransaction( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_Transaction )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, SPI_STM32L496VGT6P_ProcessType_Transaction );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != SPI_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = SPI_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case SPI_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = SPI_STM32L496VGT6P_OperationTransactionExecute( Instance );
                break;

            case SPI_STM32L496VGT6P_OperationType_Transaction:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationCommitExecute( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

    // FIXME Keep CubeMX generated configurations as is for now
    #if 0
    HAL_StatusTypeDef HAL_Status = HAL_ERROR;
    if ( ( HAL_Status = HAL_SPI_Init( &Instance->Context->SPIx ) ) != HAL_OK )
    {
      Status = SPI_STM32L496VGT6P_Status_Error;
      break;
    }
    #endif

        Operation->Type = SPI_STM32L496VGT6P_OperationType_Commit;
        Operation->Handler = SPI_STM32L496VGT6P_OperationCommitResolve;
        Operation->Status = SPI_STM32L496VGT6P_Status_Success;
        Operation->Timeout = SPI_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 0 ) ) != TIM_Status_Success )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationCommitResolve( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != SPI_STM32L496VGT6P_OperationType_Commit )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, SPI_STM32L496VGT6P_OperationType_Commit );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( SPI_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
            break;
        }
    }
    while ( 0 );

