bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransmitExecute( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
    #if USE_DMA
        if ( ( HAL_Status = HAL_SPI_Transmit_DMA( &Context->SPIx, Operation->Context.DataTx, Operation->Context.DataTxLength ) ) != HAL_OK )
    #else
        if ( ( HAL_Status = HAL_SPI_Transmit_IT( &Context->SPIx, Operation->Context.DataTx, Operation->Context.DataTxLength ) ) != HAL_OK )
    #endif
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        Operation->Type = SPI_STM32L496VGT6P_OperationType_Transmit;
        Operation->Handler = SPI_STM32L496VGT6P_OperationTransmitResolve;
        Operation->Status = SPI_STM32L496VGT6P_Status_Success;
        Operation->Timeout = SPI_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 1000 ) ) != TIM_Status_Success )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransmitResolve( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != SPI_STM32L496VGT6P_OperationType_Transmit )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, SPI_STM32L496VGT6P_OperationType_Transmit );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( SPI_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Timeout;
            Operation->Handler = NULL;
            break;
        }

        if ( ( Context->Event & SPI_STM32L496VGT6P_Event_TxComplete ) == SPI_STM32L496VGT6P_Event_TxComplete )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationReceiveExecute( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
    #if USE_DMA
        if ( ( HAL_Status = HAL_SPI_Receive_DMA( &Context->SPIx, Operation->Context.DataRx, Operation->Context.DataRxLength ) ) != HAL_OK )
    #else
        if ( ( HAL_Status = HAL_SPI_Receive_IT( &Context->SPIx, Operation->Context.DataRx, Operation->Context.DataRxLength ) ) != HAL_OK )
    #endif
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        Operation->Type = SPI_STM32L496VGT6P_OperationType_Receive;
        Operation->Handler = SPI_STM32L496VGT6P_OperationReceiveResolve;
        Operation->Status = SPI_STM32L496VGT6P_Status_Success;
        Operation->Timeout = SPI_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 1000 ) ) != TIM_Status_Success )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationReceiveResolve( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != SPI_STM32L496VGT6P_OperationType_Receive )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, SPI_STM32L496VGT6P_OperationType_Receive );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( SPI_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Timeout;
            Operation->Handler = NULL;
            break;
        }

        if ( ( Context->Event & SPI_STM32L496VGT6P_Event_RxComplete ) != 0 )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
        }
    }
    while ( 0 );

    return Status;
}

