bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransactionExecute( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
    #if USE_DMA
        if ( ( HAL_Status = HAL_SPI_TransmitReceive_DMA( &Context->SPIx, Operation->Context.DataTx, Operation->Context.DataRx, UTIL_Max( Operation->Context.DataTxLength, Operation->Context.DataRxLength ) ) ) != HAL_OK )
    #else
        if ( ( HAL_Status = HAL_SPI_TransmitReceive_IT( &Context->SPIx, Operation->Context.DataTx, Operation->Context.DataRx, UTIL_Max( Operation->Context.DataTxLength, Operation->Context.DataRxLength ) ) ) != HAL_OK )
    #endif
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
        Operation->Type = SPI_STM32L496VGT6P_OperationType_Transaction;
        Operation->Handler = SPI_STM32L496VGT6P_OperationTransactionResolve;
        Operation->Status = SPI_STM32L496VGT6P_Status_Success;
        Operation->Timeout = SPI_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 1000 ) ) != TIM_Status_Success )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_OperationTransactionResolve( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Success;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != SPI_STM32L496VGT6P_OperationType_Transaction )
        {
            SPI_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, SPI_STM32L496VGT6P_OperationType_Transaction );
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( SPI_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Timeout;
            Operation->Handler = NULL;
            break;
        }

        if ( ( Context->Event & ( SPI_STM32L496VGT6P_Event_TxComplete | SPI_STM32L496VGT6P_Event_RxComplete ) ) == ( SPI_STM32L496VGT6P_Event_TxComplete | SPI_STM32L496VGT6P_Event_RxComplete ) )
        {
            Operation->Status = SPI_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
        }
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Method(s) #######################################################
// #############################################################################

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Initialize( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Context_Initialize( ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Instance_Initialize( Instance ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Cycle( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;
    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Context_Cycle( ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Instance_Cycle( Instance ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_DeInitialize( SPI_STM32L496VGT6P_Instance_t * Instance )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Instance_DeInitialize( Instance ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = SPI_STM32L496VGT6P_Context_DeInitialize( ) ) != SPI_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Write( SPI_STM32L496VGT6P_Instance_t * Instance, SPI_STM32L496VGT6P_Data_t * Data, SPI_STM32L496VGT6P_DataLength_t DataLength )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

