bassem-mostafa/SPI_STM32L496VGT6P/SPI_STM32L496VGT6P.c
        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        Status = SPI_STM32L496VGT6P_Status_Success;

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_None
             || Operation->Type != SPI_STM32L496VGT6P_OperationType_None )
        {
            Status = SPI_STM32L496VGT6P_Status_Busy;
            break;
        }

        Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_Transmit );

        Operation->Context.DataTx = Data;
        Operation->Context.DataTxLength = DataLength;
    }
    while ( 0 );

    return Status;
}

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Read( SPI_STM32L496VGT6P_Instance_t * Instance, SPI_STM32L496VGT6P_Data_t * Data, SPI_STM32L496VGT6P_DataLength_t DataLength )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        Status = SPI_STM32L496VGT6P_Status_Success;

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_None
             || Operation->Type != SPI_STM32L496VGT6P_OperationType_None )
        {
            Status = SPI_STM32L496VGT6P_Status_Busy;
            break;
        }

        Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_Receive );

        Operation->Context.DataRx = Data;
        Operation->Context.DataRxLength = DataLength;
    }
    while ( 0 );

    return Status;
}

SPI_STM32L496VGT6P_Status_t SPI_STM32L496VGT6P_Transaction( SPI_STM32L496VGT6P_Instance_t * Instance, SPI_STM32L496VGT6P_Data_t * DataTx, SPI_STM32L496VGT6P_DataLength_t DataTxLength, SPI_STM32L496VGT6P_Data_t * DataRx, SPI_STM32L496VGT6P_DataLength_t DataRxLength )
{
    SPI_STM32L496VGT6P_Status_t Status = SPI_STM32L496VGT6P_Status_Error;

    do
    {
        SPI_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = SPI_STM32L496VGT6P_Status_Error;
            break;
        }

        Status = SPI_STM32L496VGT6P_Status_Success;

        SPI_STM32L496VGT6P_Instance_Context_t * Context = &SPI_STM32L496VGT6P_Context.Context[ Instance->SPIx ];
        SPI_STM32L496VGT6P_Process_t * Process = &Context->Process;
        SPI_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != SPI_STM32L496VGT6P_ProcessType_None
             || Operation->Type != SPI_STM32L496VGT6P_OperationType_None )
        {
            Status = SPI_STM32L496VGT6P_Status_Busy;
            break;
        }

        Status = SPI_STM32L496VGT6P_SetProcess( Instance, SPI_STM32L496VGT6P_ProcessType_Transaction );

        Operation->Context.DataTx = DataTx;
        Operation->Context.DataTxLength = DataTxLength;
        Operation->Context.DataRx = DataRx;
        Operation->Context.DataRxLength = DataRxLength;
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Variable(s) #####################################################
// #############################################################################

const char SPI_STM32L496VGT6P_VERSION[] = "0.0.0.v20260124-1653";

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#endif /* STM32L496xx */

// #############################################################################
// #### END OF FILE ############################################################
// #############################################################################
